CkovMk/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_B1_11 (coord C13), KEY_BTUP */
#define RTE_KEY_BTUP_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_KEY_BTUP_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_KEY_BTUP_PIN                                                     27U   /*!< GPIO2 pin index: 27 */

/* GPIO_B1_09 (coord A13), KEY_BTLF */
#define RTE_KEY_BTLF_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_KEY_BTLF_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_KEY_BTLF_PIN                                                     25U   /*!< GPIO2 pin index: 25 */

/* GPIO_B1_10 (coord B13), KEY_BTOK */
#define RTE_KEY_BTOK_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_KEY_BTOK_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_KEY_BTOK_PIN                                                     26U   /*!< GPIO2 pin index: 26 */

/* GPIO_B1_08 (coord A12), KEY_BTRT */
#define RTE_KEY_BTRT_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_KEY_BTRT_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_KEY_BTRT_PIN                                                     24U   /*!< GPIO2 pin index: 24 */

/* GPIO_B1_07 (coord B12), KEY_BTDN */
#define RTE_KEY_BTDN_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_KEY_BTDN_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_KEY_BTDN_PIN                                                     23U   /*!< GPIO2 pin index: 23 */

/* GPIO_B1_06 (coord C12), BEEP_EN */
#define RTE_BEEP_EN_GPIO                                                   GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_BEEP_EN_PORT                                                   GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_BEEP_EN_PIN                                                      22U   /*!< GPIO2 pin index: 22 */

/* GPIO_B1_05 (coord D12), SERVO_EN */
#define RTE_SERVO_EN_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_SERVO_EN_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_SERVO_EN_PIN                                                     21U   /*!< GPIO2 pin index: 21 */

/* GPIO_B1_04 (coord E12), KEY_BTSE */
#define RTE_KEY_BTSE_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_KEY_BTSE_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_KEY_BTSE_PIN                                                     20U   /*!< GPIO2 pin index: 20 */

/* GPIO_B1_02 (coord C11), MOTOR_EN */
#define RTE_MOTOR_EN_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_MOTOR_EN_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_MOTOR_EN_PIN                                                     18U   /*!< GPIO2 pin index: 18 */

/* GPIO_B1_01 (coord B11), KEY_BTME */
#define RTE_KEY_BTME_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_KEY_BTME_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_KEY_BTME_PIN                                                     17U   /*!< GPIO2 pin index: 17 */

/* GPIO_B0_15 (coord E11), TOF0_XHT */
#define RTE_TOF0_XHT_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_TOF0_XHT_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_TOF0_XHT_PIN                                                     15U   /*!< GPIO2 pin index: 15 */

/* GPIO_B0_14 (coord E10), TOF0_INT */
#define RTE_TOF0_INT_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_TOF0_INT_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_TOF0_INT_PIN                                                     14U   /*!< GPIO2 pin index: 14 */

/* GPIO_B0_13 (coord D10), TOF1_XHT */
#define RTE_TOF1_XHT_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_TOF1_XHT_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_TOF1_XHT_PIN                                                     13U   /*!< GPIO2 pin index: 13 */

/* GPIO_B0_12 (coord C10), TOF1_INT */
#define RTE_TOF1_INT_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_TOF1_INT_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_TOF1_INT_PIN                                                     12U   /*!< GPIO2 pin index: 12 */

/* GPIO_B0_11 (coord A10), PWM2_B2 */
#define RTE_PWM2_B2_PERIPHERAL                                              PWM2   /*!< Device name: PWM2 */
#define RTE_PWM2_B2_SIGNAL                                                     B   /*!< PWM2 signal: B */
#define RTE_PWM2_B2_CHANNEL                                                   2U   /*!< PWM2 B channel: 2 */

/* GPIO_B0_10 (coord D9), PWM2_A2 */
#define RTE_PWM2_A2_PERIPHERAL                                              PWM2   /*!< Device name: PWM2 */
#define RTE_PWM2_A2_SIGNAL                                                     A   /*!< PWM2 signal: A */
#define RTE_PWM2_A2_CHANNEL                                                   2U   /*!< PWM2 A channel: 2 */

/* GPIO_B0_09 (coord C9), PWM2_B1 */
#define RTE_PWM2_B1_PERIPHERAL                                              PWM2   /*!< Device name: PWM2 */
#define RTE_PWM2_B1_SIGNAL                                                     B   /*!< PWM2 signal: B */
#define RTE_PWM2_B1_CHANNEL                                                   1U   /*!< PWM2 B channel: 1 */

