CkovMk/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/* GPIO_B0_07 (coord A9), PWM2_B0 */
#define RTE_PWM2_B0_PERIPHERAL                                              PWM2   /*!< Device name: PWM2 */
#define RTE_PWM2_B0_SIGNAL                                                     B   /*!< PWM2 signal: B */
#define RTE_PWM2_B0_CHANNEL                                                   0U   /*!< PWM2 B channel: 0 */

/* GPIO_B0_06 (coord A8), PWM2_A0 */
#define RTE_PWM2_A0_PERIPHERAL                                              PWM2   /*!< Device name: PWM2 */
#define RTE_PWM2_A0_SIGNAL                                                     A   /*!< PWM2 signal: A */
#define RTE_PWM2_A0_CHANNEL                                                   0U   /*!< PWM2 A channel: 0 */

/* GPIO_B0_05 (coord B8), I2C2_SDA */
#define RTE_I2C2_SDA_PERIPHERAL                                           LPI2C2   /*!< Device name: LPI2C2 */
#define RTE_I2C2_SDA_SIGNAL                                                  SDA   /*!< LPI2C2 signal: SDA */

/* GPIO_B0_04 (coord C8), I2C2_SCL */
#define RTE_I2C2_SCL_PERIPHERAL                                           LPI2C2   /*!< Device name: LPI2C2 */
#define RTE_I2C2_SCL_SIGNAL                                                  SCL   /*!< LPI2C2 signal: SCL */

/* GPIO_B0_03 (coord D8), SPI4_SCK */
#define RTE_SPI4_SCK_PERIPHERAL                                           LPSPI4   /*!< Device name: LPSPI4 */
#define RTE_SPI4_SCK_SIGNAL                                                  SCK   /*!< LPSPI4 signal: SCK */

/* GPIO_B0_02 (coord E8), SPI4_SDO */
#define RTE_SPI4_SDO_PERIPHERAL                                           LPSPI4   /*!< Device name: LPSPI4 */
#define RTE_SPI4_SDO_SIGNAL                                                  SDO   /*!< LPSPI4 signal: SDO */

/* GPIO_B0_01 (coord E7), DISP_BKL */
#define RTE_DISP_BKL_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_DISP_BKL_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_DISP_BKL_PIN                                                      1U   /*!< GPIO2 pin index: 1 */

/* GPIO_B0_00 (coord D7), DISP_D_C */
#define RTE_DISP_D_C_GPIO                                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define RTE_DISP_D_C_PORT                                                  GPIO2   /*!< PORT device name: GPIO2 */
#define RTE_DISP_D_C_PIN                                                      0U   /*!< GPIO2 pin index: 0 */

/* GPIO_B1_12 (coord D13), UART5_TX */
#define RTE_UART5_TX_PERIPHERAL                                          LPUART5   /*!< Device name: LPUART5 */
#define RTE_UART5_TX_SIGNAL                                                   TX   /*!< LPUART5 signal: TX */

/* GPIO_B1_13 (coord D14), UART5_RX */
#define RTE_UART5_RX_PERIPHERAL                                          LPUART5   /*!< Device name: LPUART5 */
#define RTE_UART5_RX_SIGNAL                                                   RX   /*!< LPUART5 signal: RX */

/* GPIO_B1_15 (coord B14), PWM4_A3 */
#define RTE_PWM4_A3_PERIPHERAL                                              PWM4   /*!< Device name: PWM4 */
#define RTE_PWM4_A3_SIGNAL                                                     A   /*!< PWM4 signal: A */
#define RTE_PWM4_A3_CHANNEL                                                   3U   /*!< PWM4 A channel: 3 */

/* GPIO_B1_14 (coord C14), PWM4_B3 */
#define RTE_PWM4_A2_PERIPHERAL                                              PWM4   /*!< Device name: PWM4 */
#define RTE_PWM4_A2_SIGNAL                                                     A   /*!< PWM4 signal: A */
#define RTE_PWM4_A2_CHANNEL                                                   2U   /*!< PWM4 A channel: 2 */

/* GPIO_EMC_41 (coord C7), DISP_RST */
#define RTE_DISP_RST_GPIO                                                  GPIO3   /*!< GPIO device name: GPIO3 */
#define RTE_DISP_RST_PORT                                                  GPIO3   /*!< PORT device name: GPIO3 */
#define RTE_DISP_RST_PIN                                                     27U   /*!< GPIO3 pin index: 27 */

/* GPIO_SD_B0_00 (coord J4), SDHC_CMD */
#define RTE_SDHC_CMD_PERIPHERAL                                           USDHC1   /*!< Device name: USDHC1 */
#define RTE_SDHC_CMD_SIGNAL                                            usdhc_cmd   /*!< USDHC1 signal: usdhc_cmd */

/* GPIO_SD_B0_01 (coord J3), SDHC_CLK */
#define RTE_SDHC_CLK_PERIPHERAL                                           USDHC1   /*!< Device name: USDHC1 */
#define RTE_SDHC_CLK_SIGNAL                                            usdhc_clk   /*!< USDHC1 signal: usdhc_clk */

/* GPIO_SD_B0_02 (coord J1), SDHC_D0 */
#define RTE_SDHC_D0_PERIPHERAL                                            USDHC1   /*!< Device name: USDHC1 */
#define RTE_SDHC_D0_SIGNAL                                            usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define RTE_SDHC_D0_CHANNEL                                                   0U   /*!< USDHC1 usdhc_data channel: 0 */

/* GPIO_SD_B0_03 (coord K1), SDHC_D1 */
#define RTE_SDHC_D1_PERIPHERAL                                            USDHC1   /*!< Device name: USDHC1 */
#define RTE_SDHC_D1_SIGNAL                                            usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define RTE_SDHC_D1_CHANNEL                                                   1U   /*!< USDHC1 usdhc_data channel: 1 */

/* GPIO_SD_B0_04 (coord H2), SDHC_D2 */
#define RTE_SDHC_D2_PERIPHERAL                                            USDHC1   /*!< Device name: USDHC1 */
#define RTE_SDHC_D2_SIGNAL                                            usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define RTE_SDHC_D2_CHANNEL                                                   2U   /*!< USDHC1 usdhc_data channel: 2 */

/* GPIO_SD_B0_05 (coord J2), SDHC_D3 */
#define RTE_SDHC_D3_PERIPHERAL                                            USDHC1   /*!< Device name: USDHC1 */
#define RTE_SDHC_D3_SIGNAL                                            usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define RTE_SDHC_D3_CHANNEL                                                   3U   /*!< USDHC1 usdhc_data channel: 3 */

