CkovMk/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/* GPIO_SD_B1_00 (coord L5), UART4_TX */
#define RTE_UART4_TX_PERIPHERAL                                          LPUART4   /*!< Device name: LPUART4 */
#define RTE_UART4_TX_SIGNAL                                                   TX   /*!< LPUART4 signal: TX */

/* GPIO_SD_B1_01 (coord M5), UART4_RX */
#define RTE_UART4_RX_PERIPHERAL                                          LPUART4   /*!< Device name: LPUART4 */
#define RTE_UART4_RX_SIGNAL                                                   RX   /*!< LPUART4 signal: RX */

/* GPIO_SD_B1_02 (coord M3), TCS_INT */
#define RTE_TCS_INT_GPIO                                                   GPIO3   /*!< GPIO device name: GPIO3 */
#define RTE_TCS_INT_PORT                                                   GPIO3   /*!< PORT device name: GPIO3 */
#define RTE_TCS_INT_PIN                                                       2U   /*!< GPIO3 pin index: 2 */

/* GPIO_SD_B1_03 (coord M4), IMU_INT */
#define RTE_IMU_INT_GPIO                                                   GPIO3   /*!< GPIO device name: GPIO3 */
#define RTE_IMU_INT_PORT                                                   GPIO3   /*!< PORT device name: GPIO3 */
#define RTE_IMU_INT_PIN                                                       3U   /*!< GPIO3 pin index: 3 */

/* GPIO_SD_B1_04 (coord P2), I2C1_SCL */
#define RTE_I2C1_SCL_PERIPHERAL                                           LPI2C1   /*!< Device name: LPI2C1 */
#define RTE_I2C1_SCL_SIGNAL                                                  SCL   /*!< LPI2C1 signal: SCL */

/* GPIO_SD_B1_05 (coord N3), I2C1_SDA */
#define RTE_I2C1_SDA_PERIPHERAL                                           LPI2C1   /*!< Device name: LPI2C1 */
#define RTE_I2C1_SDA_SIGNAL                                                  SDA   /*!< LPI2C1 signal: SDA */

/* GPIO_AD_B1_15 (coord J14), CAM_D2 */
#define RTE_CAM_D2_PERIPHERAL                                                CSI   /*!< Device name: CSI */
#define RTE_CAM_D2_SIGNAL                                               csi_data   /*!< CSI signal: csi_data */
#define RTE_CAM_D2_CHANNEL                                                    2U   /*!< CSI csi_data channel: 02 */

/* GPIO_AD_B1_14 (coord G12), CAM_D3 */
#define RTE_CAM_D3_PERIPHERAL                                                CSI   /*!< Device name: CSI */
#define RTE_CAM_D3_SIGNAL                                               csi_data   /*!< CSI signal: csi_data */
#define RTE_CAM_D3_CHANNEL                                                    3U   /*!< CSI csi_data channel: 03 */

/* GPIO_AD_B1_13 (coord H11), CAM_D4 */
#define RTE_CAM_D4_PERIPHERAL                                                CSI   /*!< Device name: CSI */
#define RTE_CAM_D4_SIGNAL                                               csi_data   /*!< CSI signal: csi_data */
#define RTE_CAM_D4_CHANNEL                                                    4U   /*!< CSI csi_data channel: 04 */

/* GPIO_AD_B1_12 (coord H12), CAM_D5 */
#define RTE_CAM_D5_PERIPHERAL                                                CSI   /*!< Device name: CSI */
#define RTE_CAM_D5_SIGNAL                                               csi_data   /*!< CSI signal: csi_data */
#define RTE_CAM_D5_CHANNEL                                                    5U   /*!< CSI csi_data channel: 05 */

/* GPIO_AD_B1_11 (coord J13), CAM_D6 */
#define RTE_CAM_D6_PERIPHERAL                                                CSI   /*!< Device name: CSI */
#define RTE_CAM_D6_SIGNAL                                               csi_data   /*!< CSI signal: csi_data */
#define RTE_CAM_D6_CHANNEL                                                    6U   /*!< CSI csi_data channel: 06 */

/* GPIO_AD_B1_10 (coord L13), CAM_D7 */
#define RTE_CAM_D7_PERIPHERAL                                                CSI   /*!< Device name: CSI */
#define RTE_CAM_D7_SIGNAL                                               csi_data   /*!< CSI signal: csi_data */
#define RTE_CAM_D7_CHANNEL                                                    7U   /*!< CSI csi_data channel: 07 */

/* GPIO_AD_B1_09 (coord M13), CAM_D8 */
#define RTE_CAM_D8_PERIPHERAL                                                CSI   /*!< Device name: CSI */
#define RTE_CAM_D8_SIGNAL                                               csi_data   /*!< CSI signal: csi_data */
#define RTE_CAM_D8_CHANNEL                                                    8U   /*!< CSI csi_data channel: 08 */

/* GPIO_AD_B1_08 (coord H13), CAM_D9 */
#define RTE_CAM_D9_PERIPHERAL                                                CSI   /*!< Device name: CSI */
#define RTE_CAM_D9_SIGNAL                                               csi_data   /*!< CSI signal: csi_data */
#define RTE_CAM_D9_CHANNEL                                                    9U   /*!< CSI csi_data channel: 09 */

/* GPIO_AD_B1_07 (coord K10), CAM_HREF */
#define RTE_CAM_HREF_PERIPHERAL                                              CSI   /*!< Device name: CSI */
#define RTE_CAM_HREF_SIGNAL                                            csi_hsync   /*!< CSI signal: csi_hsync */

/* GPIO_AD_B1_06 (coord J12), CAM_VSNC */
#define RTE_CAM_VSNC_PERIPHERAL                                              CSI   /*!< Device name: CSI */
#define RTE_CAM_VSNC_SIGNAL                                            csi_vsync   /*!< CSI signal: csi_vsync */

/* GPIO_AD_B1_05 (coord K12), CAM_XCLK */
#define RTE_CAM_XCLK_PERIPHERAL                                              CSI   /*!< Device name: CSI */
#define RTE_CAM_XCLK_SIGNAL                                             csi_mclk   /*!< CSI signal: csi_mclk */

/* GPIO_AD_B1_04 (coord L12), CAM_PCLK */
#define RTE_CAM_PCLK_PERIPHERAL                                              CSI   /*!< Device name: CSI */
#define RTE_CAM_PCLK_SIGNAL                                           csi_pixclk   /*!< CSI signal: csi_pixclk */

/* GPIO_AD_B1_03 (coord M12), CAM_RST */
#define RTE_CAM_RST_GPIO                                                   GPIO1   /*!< GPIO device name: GPIO1 */
#define RTE_CAM_RST_PORT                                                   GPIO1   /*!< PORT device name: GPIO1 */
#define RTE_CAM_RST_PIN                                                      19U   /*!< GPIO1 pin index: 19 */

/* GPIO_AD_B1_02 (coord L11), MOTOR_IR */
#define RTE_MOTOR_IR_PERIPHERAL                                             ADC1   /*!< Device name: ADC1 */
#define RTE_MOTOR_IR_SIGNAL                                                   IN   /*!< ADC1 signal: IN */
#define RTE_MOTOR_IR_CHANNEL                                                  7U   /*!< ADC1 IN channel: 7 */

/* GPIO_AD_B1_01 (coord K11), VOLT_BAT */
#define RTE_VOLT_BATT_PERIPHERAL                                            ADC2   /*!< Device name: ADC2 */
#define RTE_VOLT_BATT_SIGNAL                                                  IN   /*!< ADC2 signal: IN */
#define RTE_VOLT_BATT_CHANNEL                                                 6U   /*!< ADC2 IN channel: 6 */

