CkovMk/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/* GPIO_AD_B1_00 (coord J11), MOTOR_IL */
#define RTE_MOTOR_IL_PERIPHERAL                                             ADC1   /*!< Device name: ADC1 */
#define RTE_MOTOR_IL_SIGNAL                                                   IN   /*!< ADC1 signal: IN */
#define RTE_MOTOR_IL_CHANNEL                                                  5U   /*!< ADC1 IN channel: 5 */

/* GPIO_AD_B0_15 (coord L10), SERVO_IB */
#define RTE_SERVO_IB_PERIPHERAL                                             ADC1   /*!< Device name: ADC1 */
#define RTE_SERVO_IB_SIGNAL                                                   IN   /*!< ADC1 signal: IN */
#define RTE_SERVO_IB_CHANNEL                                                  4U   /*!< ADC1 IN channel: 4 */

/* GPIO_AD_B0_14 (coord H14), SERVO_IF */
#define RTE_SERVO_IF_PERIPHERAL                                             ADC1   /*!< Device name: ADC1 */
#define RTE_SERVO_IF_SIGNAL                                                   IN   /*!< ADC1 signal: IN */
#define RTE_SERVO_IF_CHANNEL                                                  3U   /*!< ADC1 IN channel: 3 */

/* GPIO_AD_B0_12 (coord K14), UART1_TX */
#define RTE_UART1_TX_PERIPHERAL                                          LPUART1   /*!< Device name: LPUART1 */
#define RTE_UART1_TX_SIGNAL                                                   TX   /*!< LPUART1 signal: TX */

/* GPIO_AD_B0_13 (coord L14), UART1_RX */
#define RTE_UART1_RX_PERIPHERAL                                          LPUART1   /*!< Device name: LPUART1 */
#define RTE_UART1_RX_SIGNAL                                                   RX   /*!< LPUART1 signal: RX */

/* GPIO_AD_B0_07 (coord F12), SWCLK */
#define RTE_SWCLK_PERIPHERAL                                                JTAG   /*!< Device name: JTAG */
#define RTE_SWCLK_SIGNAL                                                     TCK   /*!< JTAG signal: TCK */

/* GPIO_AD_B0_06 (coord E14), SWDIO */
#define RTE_SWDIO_PERIPHERAL                                                JTAG   /*!< Device name: JTAG */
#define RTE_SWDIO_SIGNAL                                                     TMS   /*!< JTAG signal: TMS */

/* GPIO_AD_B0_05 (coord G14), BOOT_SEL1 */
#define RTE_BOOT_SEL1_PERIPHERAL                                             SRC   /*!< Device name: SRC */
#define RTE_BOOT_SEL1_SIGNAL                                           BOOT_MODE   /*!< SRC signal: BOOT_MODE */
#define RTE_BOOT_SEL1_CHANNEL                                                 1U   /*!< SRC BOOT_MODE channel: 1 */

/* GPIO_AD_B0_04 (coord F11), BOOT_SEL0 */
#define RTE_BOOT_SEL0_PERIPHERAL                                             SRC   /*!< Device name: SRC */
#define RTE_BOOT_SEL0_SIGNAL                                           BOOT_MODE   /*!< SRC signal: BOOT_MODE */
#define RTE_BOOT_SEL0_CHANNEL                                                 0U   /*!< SRC BOOT_MODE channel: 0 */

/* GPIO_AD_B0_08 (coord F13), ENC_LA */
#define RTE_ENC_LA_PERIPHERAL                                               ENC1   /*!< Device name: ENC1 */
#define RTE_ENC_LA_SIGNAL                                                  PHASE   /*!< ENC1 signal: PHASE */
#define RTE_ENC_LA_CHANNEL                                                     A   /*!< ENC1 PHASE channel: A */

/* GPIO_AD_B0_09 (coord F14), ENC_LB */
#define RTE_ENC_LB_PERIPHERAL                                               ENC1   /*!< Device name: ENC1 */
#define RTE_ENC_LB_SIGNAL                                                  PHASE   /*!< ENC1 signal: PHASE */
#define RTE_ENC_LB_CHANNEL                                                     B   /*!< ENC1 PHASE channel: B */

/* GPIO_AD_B0_11 (coord G10), ENCO_RA */
#define RTE_ENC_RA_PERIPHERAL                                               ENC2   /*!< Device name: ENC2 */
#define RTE_ENC_RA_SIGNAL                                                  PHASE   /*!< ENC2 signal: PHASE */
#define RTE_ENC_RA_CHANNEL                                                     A   /*!< ENC2 PHASE channel: A */

/* GPIO_AD_B0_10 (coord G13), ENC_RB */
#define RTE_ENC_RB_PERIPHERAL                                               ENC2   /*!< Device name: ENC2 */
#define RTE_ENC_RB_SIGNAL                                                  PHASE   /*!< ENC2 signal: PHASE */
#define RTE_ENC_RB_CHANNEL                                                     B   /*!< ENC2 PHASE channel: B */

/* GPIO_AD_B0_03 (coord G11), LED_USR */
#define RTE_LED_USR_GPIO                                                   GPIO1   /*!< GPIO device name: GPIO1 */
#define RTE_LED_USR_PORT                                                   GPIO1   /*!< PORT device name: GPIO1 */
#define RTE_LED_USR_PIN                                                       3U   /*!< GPIO1 pin index: 3 */

/* GPIO_AD_B0_02 (coord M11), LED_BUSG */
#define RTE_LED_BUSG_GPIO                                                  GPIO1   /*!< GPIO device name: GPIO1 */
#define RTE_LED_BUSG_PORT                                                  GPIO1   /*!< PORT device name: GPIO1 */
#define RTE_LED_BUSG_PIN                                                      2U   /*!< GPIO1 pin index: 2 */

/* GPIO_AD_B0_01 (coord H10), KEY_BTUR */
#define RTE_KEY_BTUS_GPIO                                                  GPIO1   /*!< GPIO device name: GPIO1 */
#define RTE_KEY_BTUS_PORT                                                  GPIO1   /*!< PORT device name: GPIO1 */
#define RTE_KEY_BTUS_PIN                                                      1U   /*!< GPIO1 pin index: 1 */

/* GPIO_AD_B0_00 (coord M14), LED_BUSR */
#define RTE_LED_BUSR_GPIO                                                  GPIO1   /*!< GPIO device name: GPIO1 */
#define RTE_LED_BUSR_PORT                                                  GPIO1   /*!< PORT device name: GPIO1 */
#define RTE_LED_BUSR_PIN                                                      0U   /*!< GPIO1 pin index: 0 */

/* GPIO_B0_08 (coord B9), PWM2_A1 */
#define RTE_PWM2_A1_PERIPHERAL                                              PWM2   /*!< Device name: PWM2 */
#define RTE_PWM2_A1_SIGNAL                                                     A   /*!< PWM2 signal: A */
#define RTE_PWM2_A1_CHANNEL                                                   1U   /*!< PWM2 A channel: 1 */

/* GPIO_B1_00 (coord A11), MOTOR_FLT */
#define RTE_MOTOR_FLT_PERIPHERAL                                            AOI1   /*!< Device name: AOI1 */
#define RTE_MOTOR_FLT_SIGNAL                                                 OUT   /*!< AOI1 signal: OUT */
#define RTE_MOTOR_FLT_CHANNEL                                                 0U   /*!< AOI1 OUT channel: 0 */

/* GPIO_B1_03 (coord D11), SERVO_FLT */
#define RTE_SERVO_FLT_PERIPHERAL                                            AOI1   /*!< Device name: AOI1 */
#define RTE_SERVO_FLT_SIGNAL                                                 OUT   /*!< AOI1 signal: OUT */
#define RTE_SERVO_FLT_CHANNEL                                                 1U   /*!< AOI1 OUT channel: 1 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTE(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SDRAM(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void FLASH(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
